# KJPerMSup2K Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KJPerMSup2K Property
SymbolTypeId Class See Also
---
Symbol kJ/(m²·K), indicating unit Kilojoules per square meter Kelvin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KJPerMSup2K { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KJPerMSup2K As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KJPerMSup2K {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace